# TriangulatedShellComponent Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriangulatedShellComponent Properties
TriangulatedShellComponent Class See Also
---
The TriangulatedShellComponent type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsClosed | True if and only if the triangulation represents a topologically closed shell (i.e., each edge is shared by two triangles). |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| TriangleCount | The number of triangles in the triangulation. |
| VertexCount | The number of vertices in the triangulation. |

# See Also
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace